# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [1]:
import numpy as np
import pandas as pd

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [2]:
bedrs = pd.Series(np.random.randint(1,5,100))
bathrs = pd.Series(np.random.randint(1, 4, 100))
price_sqr_meter = pd.Series(np.random.randint(10000, 30001, 100))

### Step 3. Let's create a DataFrame by joinning the Series by column

In [3]:
df = pd.DataFrame({
  'bedrs': bedrs,
  'bathrs': bathrs,
  'price_sqr_meter': price_sqr_meter,
})

In [4]:
df.head()

   bedrs  bathrs  price_sqr_meter
0      2       2            24807
1      4       2            24600
2      1       2            16871
3      1       2            16416
4      4       3            21411

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [5]:
df = pd.concat([bedrs, bathrs, price_sqr_meter]).to_frame()

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [6]:
df

        0
0       2
1       4
2       1
3       1
4       4
..    ...
95  29401
96  19172
97  21728
98  20942
99  16612

[300 rows x 1 columns]

In [7]:
len(df)

300

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [8]:
df.reset_index(drop=True, inplace=True)

In [9]:
df

         0
0        2
1        4
2        1
3        1
4        4
..     ...
295  29401
296  19172
297  21728
298  20942
299  16612

[300 rows x 1 columns]